Title: Select Values Within a Range
Slug: sql/select-values-within-a-range
Category: SQL
Tags: SELECT, FROM, WHERE, BETWEEN, LIMIT
Date: 2017-08-08
Modified: 2017-08-27

### Load ipython-sql extension

In [1]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

### Connect to the database

In [2]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

### Find values within a range
Note that this is an inclusive search: in the example below, movies that are 110 or 120 minutes long will be returned in the full results.

In [3]:
%%sql

SELECT
    f.title
    , f.length
FROM
    film f
WHERE
    f.length BETWEEN 110 AND 120
-- For convenience, we'll only show the first 5 results
LIMIT
    5

[('Chamber Italian', 117),
 ('Affair Prejudice', 117),
 ('Alabama Devil', 114),
 ('Amadeus Holy', 113),
 ('Apocalypse Flamingos', 119)]

### Find values outside the same range

In [4]:
%%sql

SELECT
    f.title
    , f.length
FROM
    film f
WHERE
    f.length NOT BETWEEN 110 AND 120
LIMIT
    5

[('Grosse Wonderful', 49),
 ('Airport Pollock', 54),
 ('Bright Encounters', 73),
 ('Academy Dinosaur', 86),
 ('Ace Goldfinger', 48)]

### Using `BETWEEN` with datetimes
It is easy to be caught out by datetimes when using between. In the example below `'2007-02-15'` is interpreted as '`2007-02-15 00:00:00`', so the latest results are from just before midnight.

In [12]:
%%sql

SELECT
    p.payment_id
    , p.payment_date
FROM
    payment p
WHERE
    p.payment_date BETWEEN '2007-02-14' AND '2007-02-15'
ORDER BY
    p.payment_date DESC
LIMIT
    5

[(17743, datetime.datetime(2007, 2, 14, 23, 53, 34, 996577)),
 (18322, datetime.datetime(2007, 2, 14, 23, 52, 46, 996577)),
 (19212, datetime.datetime(2007, 2, 14, 23, 47, 5, 996577)),
 (17617, datetime.datetime(2007, 2, 14, 23, 33, 58, 996577)),
 (19421, datetime.datetime(2007, 2, 14, 23, 32, 48, 996577))]

When we cast `p.payment_date` as a `date`, the time part is removed. This means that payments from `2007-02-15` are now included in the results.

In [14]:
%%sql

SELECT
    p.payment_id
    , p.payment_date
FROM
    payment p
WHERE
    p.payment_date::date BETWEEN '2007-02-14' AND '2007-02-15'
ORDER BY
    p.payment_date DESC
LIMIT
    5

[(18335, datetime.datetime(2007, 2, 15, 23, 59, 49, 996577)),
 (18676, datetime.datetime(2007, 2, 15, 23, 56, 48, 996577)),
 (18610, datetime.datetime(2007, 2, 15, 23, 52, 34, 996577)),
 (19199, datetime.datetime(2007, 2, 15, 23, 48, 31, 996577)),
 (19229, datetime.datetime(2007, 2, 15, 23, 44, 25, 996577))]